app/controllers/apparel_controller.rb

SELECT "products".* FROM "products" WHERE (category = 'Apparel')
---
  def index
    @products = Product.where("category = 'Apparel'")