app/controllers/books_controller.rb

SELECT "products".* FROM "products" WHERE (category = 'Books')
---
  def index
    @products = Product.where("category = 'Books'")