app/controllers/cart_items_controller.rb

  def create
    product = Product.find(params[:product_id])
    @cart_item = @cart.add_product(product.id)

    respond_to do |format|
      if @cart_item.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "cart_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 1], ["cart_id", 1], ["created_at", "2015-12-11 05:23:24.440462"], ["updated_at", "2015-12-11 05:23:24.440462"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-12-11 05:23:24.400281"], ["updated_at", "2015-12-11 05:23:24.400281"]]
UPDATE "cart_items" SET "quantity" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["quantity", 2], ["updated_at", "2015-12-11 05:55:47.461516"], ["id", 1]]

    def set_cart_item
      @cart_item = CartItem.find(params[:id])
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 4]]