app/controllers/computers_controller.rb

SELECT "products".* FROM "products" WHERE (category = 'Computers')
---
  def index
    @products = Product.where("category = 'Computers'")