app/controllers/orders_controller.rb

SELECT  1 AS one FROM "cart_items" WHERE "cart_items"."cart_id" = ? LIMIT 1  [["cart_id", 5]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 5]]
---
  def new
    if @cart.cart_items.empty?

INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", ""], ["address", ""], ["email", ""], ["pay_type", ""], ["created_at", "2015-12-11 07:29:20.708256"], ["updated_at", "2015-12-11 07:29:20.708256"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 5]]
---
  def create
    @order = Order.new(order_params)
    @order.add_cart_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])