app/controllers/products_controller.rb

INSERT INTO "products" ("title", "description", "price", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Book"], ["description", "It's a book"], ["price", 29.99], ["category", "Books"], ["created_at", "2015-12-11 03:53:10.441458"], ["updated_at", "2015-12-11 03:53:10.441458"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save