app/controllers/supplies_controller.rb

  def index
    @products = Product.where("category = 'School Supplies'")
---
SELECT "products".* FROM "products" WHERE (category = 'School Supplies')